###  Project 1 : Exploratory Data Analysis : Titanic Dataset

In [ ]:
# Import Libraries

import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
# Load titanic dataset

df = sns.load_dataset('titanic')

In [ ]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
# 1. Display Total Number of Rows and Columns.
# 2. Display Column Survived.
# 3. Display Sex, Age, Fare.
# 4. Display Data types of each feature.

In [ ]:
# 1. Display Total Number of Rows and Columns.

print("Rows    : ", df.shape[0], "\nCOlumns : ", df.shape[1])

Rows    :  891
COlumns :  15

In [ ]:
# 2. Display Column Survived.

df['survived']

In [ ]:
# 3. Display Sex, Age, Fare.

df[['sex', 'age', 'fare']]

In [ ]:
# 4. Display Data types of each feature.

df.dtypes

In [ ]:
# head() tail() sample()

# 5. Display first 5 rows.
# 6. Display first 7 rows.
# 7. Display random 3 rows.
# 8. Display Last 5 rows.
# 9. Display rows from 51 to 60.
# 10. Display 501 to 550.
# 11. Display all even rows from 777 to 888.
# 12 Display every fifth rows from 251 to 300.

In [ ]:
# 5. Display first 5 rows.

df.head()

In [ ]:
# 6. Display first 7 rows.

df.head(7)

In [ ]:
# 7. Display random 3 rows.

df.sample(3)

In [ ]:
# 8. Display Last 5 rows.

df.tail()

In [ ]:
# 9. Display rows from 51 to 60.

df.iloc[51 : 61]

In [ ]:
# 10. Display 501 to 550.

df.iloc[501 : 551]

In [ ]:
# 11. Display all even rows from 777 to 888.

df.iloc[778 : 889 : 2 ]

In [ ]:
# 12 Display every fifth rows from 251 to 300.

df.iloc[251 : 301 : 5 ]

In [ ]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
# 13. Display fist 25 rows of 'survived', 'pclass', age', 'sibsp'.
# 14. DIsplay random 5 rows for 'who', 'deck', 'survived'.
# 15. Display all rows from 151 to 200 of 'sex', 'pclass', 'embark_town'
# 16. Display every 7th row fro 555 to 666 for 'age', 'fare', sex, survived.
# 17. Display all numerical features from 444 to 555.
# 18. Display non numerical features from 666 to 777.

In [ ]:
# 13. Display fist 25 rows of 'survived', 'pclass', age', 'sibsp'.

df[['survived', 'pclass', 'age', 'sibsp']].iloc[ : 25]

In [ ]:
df.loc[: 25][['survived', 'pclass', 'age', 'sibsp']]

In [ ]:
# 14. Display random 5 rows for 'who', 'deck', 'survived'.

df[['who', 'deck', 'survived']].sample(5)

In [ ]:
# 15. Display all rows from 151 to 200 of 'sex', 'pclass', 'embark_town'

df[['sex', 'pclass', 'embark_town']].iloc[151 : 201 ]

In [ ]:
# 16. Display every 7th row fro 555 to 666 for 'age', 'fare', sex, survived.

df[['age', 'fare', 'sex', 'survived']].iloc[555 : 666+1 : 7 ]

In [ ]:
# 17. Display all numerical features from 444 to 555.

df.select_dtypes(include=['int64' ,  'float64' ]).iloc[444 : 555+1]

In [ ]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [ ]:
# 18. Display non numerical features from 666 to 777.

df.select_dtypes(exclude='number').iloc[666 : 777+1]

In [ ]:
# 19.  Display all passengers travelling in first class.
# 20   Display all about 'male'
# 21. Display all where town = Southampton
# 22. DIsplay all who Survived.
# 23. Display all who paid above average fair.    mean()

In [ ]:
# 19.  Display all passengers travelling in first class.

df[df.pclass == 1 ]

In [ ]:
# 20   Display all about 'male'

df[df.sex == 'male']

In [ ]:
# 21. Display all where town = Southampton

df[df.embark_town == 'Southampton']

In [ ]:
# 22. DIsplay all who Survived.    1 : survived

df[df.survived == 1]

In [ ]:
# 23. Display all who paid above average fair.    mean()

df[df.fare >= df.fare.mean()]

In [ ]:
# Multiple conditions :
# Bitwise Operators  : and & , or |, not !

In [ ]:
# 24. DIsplay females in first 100 rows that embarked at 'C'
# 25. DIsplay males from 2 class.
# 26. DIsplay females from 2,3 class.
# 27. Display passengers that survived , travelling in class 1 .
# 28. Display passengers that survived travelling with family membrs.

In [ ]:
# 24. DIsplay females in first 100 rows that embarked at 'C'

df.head(100)[(df.sex == 'female') & (df.embarked == 'C')]

In [ ]:
# 25. Display males from 2 class.

df[(df.sex == 'male' ) & (df.pclass == 2 )]

In [ ]:
# 26. Display females from 2,3 class.

df[((df.pclass == 2) | (df.pclass == 3 ))  & (df.sex == 'female')]

In [ ]:
# 27. Display passengers that survived , travelling in class 1 .

In [ ]:
# 28. Display passengers that survived travelling with family membrs.

df[((df.sibsp > 0) | (df.parch > 0 )) & df.survived == 1 ]

In [ ]:
# 29. Create a new column as total_family_members.

df['Family Members'] = df['sibsp'] + df['parch']

In [ ]:
# 30. Display all males that were travelling alone.

df[(df.sex == 'male') & (df['Family Members'] == 0 )]

In [ ]:
df[(df.sex == 'male') & (df.alone == True )]

In [ ]:
# 1. value_counts()

In [ ]:
# 31. Display Survival Status also %.
# 32. Display count of male/female.
# 33. Display count of passengers travelling in each class.
# 34. Display count of passengers embarked at each station.

In [ ]:
# 31. Display Survival Status also %.

df['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [ ]:
# %  Survival Status

np.round(df['survived'].value_counts() / df.shape[0] * 100 , 2)

0    61.62
1    38.38
Name: survived, dtype: float64

In [ ]:
# 32. Display count of male/female.

df['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [ ]:
# 33. Display count of passengers travelling in each class.

df['pclass'].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [ ]:
np.round(df['pclass'].value_counts() / df['pclass'].value_counts().sum() * 100 , 2)

3    55.11
1    24.24
2    20.65
Name: pclass, dtype: float64

In [ ]:
# 34. Display count of passengers embarked at each station.

df['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [ ]:
# 35. Display survival status
# i.  male.
# ii. pclass 3
# iii. males with no family members
# iv. embarked at Cherbourg

In [ ]:
# i.  male.

df[df.sex == 'male']['survived'].value_counts()

0    468
1    109
Name: survived, dtype: int64

In [ ]:
np.round(df[df.sex == 'male']['survived'].value_counts() / df[df.sex == 'male']['survived'].value_counts().sum() * 100 ,2 )

0    81.11
1    18.89
Name: survived, dtype: float64

In [ ]:
# ii. pclass 3

df[df.pclass == 3]['survived'].value_counts()

0    372
1    119
Name: survived, dtype: int64

In [ ]:
np.round(df[df.pclass == 3]['survived'].value_counts() / df[df.pclass == 3]['survived'].value_counts().sum() * 100 )

0    76.0
1    24.0
Name: survived, dtype: float64

In [ ]:
# iii. male with no family members

df[(df.sex == 'male' ) & (df.alone == True)]['survived'].value_counts()

0    347
1     64
Name: survived, dtype: int64

In [ ]:
df[(df.sex == 'male' ) & (df.alone == True)]['survived'].value_counts()  / df[(df.sex == 'male' ) & (df.alone == True)]['survived'].value_counts().sum()

0    0.844282
1    0.155718
Name: survived, dtype: float64

In [ ]:
# iv. embarked at Cherbourg

df[ df.embark_town == 'Cherbourg']['survived'].value_counts()

1    93
0    75
Name: survived, dtype: int64

In [ ]:
# 2. Bi Vairate Analysis :

In [ ]:
# groupby()

In [ ]:
# 36. Display Survival Status of
# i.   each sex
# ii.  each passenger class
# iii. embark_town
# iv.  family members

In [ ]:
# i.   each sex

df.groupby('sex')['survived'].value_counts().unstack()

survived    0    1
sex
female     81  233
male      468  109

In [ ]:
df.groupby('sex')['survived'].value_counts().unstack() / 891 * 100

survived          0          1
sex
female     9.090909  26.150393
male      52.525253  12.233446

In [ ]:
# 1. sex
df.groupby('sex')['survived'].value_counts().unstack()

survived    0    1
sex
female     81  233
male      468  109

In [ ]:
df.groupby('sex')['survived'].value_counts(normalize = True ).unstack().round(2)

survived     0     1
sex
female    0.26  0.74
male      0.81  0.19

In [ ]:
# ii.  each passenger class

df.groupby('pclass')['survived'].value_counts().unstack()

survived    0    1
pclass
1          80  136
2          97   87
3         372  119

In [ ]:
df.groupby('pclass')['survived'].value_counts(normalize = True ).unstack().round(2)

In [ ]:
# iii. embark_town

df.groupby('embark_town')['survived'].value_counts().unstack()

survived       0    1
embark_town
Cherbourg     75   93
Queenstown    47   30
Southampton  427  217

In [ ]:
df.groupby('embark_town')['survived'].value_counts(normalize = True ).unstack().round(4) * 100

survived         0      1
embark_town
Cherbourg    44.64  55.36
Queenstown   61.04  38.96
Southampton  66.30  33.70

In [ ]:
# iv.  family members

df.groupby('alone')['survived'].value_counts().unstack()

survived    0    1
alone
False     175  179
True      374  163

In [ ]:
# 3. Multi Variate Analysis

In [ ]:
# Find Survival Status of

# 1. Each Sex travelling wrt passenger class.

In [ ]:
# 1. Each Sex travelling wrt passenger class.

df.groupby(['pclass', 'sex'])['survived'].value_counts().unstack()

survived         0   1
pclass sex
1      female    3  91
       male     77  45
2      female    6  70
       male     91  17
3      female   72  72
       male    300  47